[
  {
    "id": "01",
    "name": "JavaScript",
    "title": "JavaScript Tutorial",
    "price": "150",
    "thumbnail_url": "https://i.ibb.co/m6Y0q3h/Java-Script-thumbnail.png",
    "img_url": "https://i.ibb.co/GWDZ68B/javascript.png",
    "ques": "What is JavaScript",
    "details": "JavaScript (JS) is a light-weight object-oriented programming language which is used by several websites for scripting the webpages. It is an interpreted, full-fledged programming language that enables dynamic interactivity on websites when applied to an HTML document. It was introduced in the year 1995 for adding programs to the webpages in the Netscape Navigator browser. Since then, it has been adopted by all other graphical web browsers. With JavaScript, users can build modern web applications to interact directly without reloading the page every time. The traditional website uses js to provide several forms of interactivity and simplicity. Although, JavaScript has no connectivity with Java programming language. The name was suggested and provided in the times when Java was gaining popularity in the market. In addition to web browsers, databases such as CouchDB and MongoDB uses JavaScript as their scripting and query language.",
    "premiumStatus": false
  },
  {
    "id": "02",
    "name": "Python",
    "title": "Python Tutorial",
    "price": "250",
    "thumbnail_url": "https://i.ibb.co/2YHTtKW/python-thumbnail.png",
    "img_url": "https://i.ibb.co/p4q2wmg/Python.png",
    "ques": "What is Python",
    "details": "Python is a general purpose, dynamic, high-level, and interpreted programming language. It supports Object Oriented programming approach to develop applications. It is simple and easy to learn and provides lots of high-level data structures.Python is easy to learn yet powerful and versatile scripting language, which makes it attractive for Application Development. Python's syntax and dynamic typing with its interpreted nature make it an ideal language for scripting and rapid application development. Python supports multiple programming pattern, including object-oriented, imperative, and functional or procedural programming styles. Python is not intended to work in a particular area, such as web programming. That is why it is known as multipurpose programming language because it can be used with web, enterprise, 3D CAD, etc. We dont need to use data types to declare variable because it is dynamically typed so we can write a=10 to assign an integer value in an integer variable. Python makes the development and debugging fast because there is no compilation step included in Python development, and edit-test-debug cycle is very fast. ",
    "premiumStatus": false
  },
  {
    "id": "03",
    "name": "Java",
    "title": "Java Tutorial",
    "price": "170",
    "thumbnail_url": "https://i.ibb.co/VCh6zTS/java-thumbnail.png",
    "img_url": "https://i.ibb.co/qL8yHLd/java.png",
    "ques": "What is Java",
    "details": "Java is a programming language and a platform. Java is a high level, robust, object-oriented and secure programming language. Java was developed by Sun Microsystems (which is now the subsidiary of Oracle) in the year 1995. James Gosling is known as the father of Java. Before Java, its name was Oak. Since Oak was already a registered company, so James Gosling and his team changed the name from Oak to Java.Platform: Any hardware or software environment in which a program runs, is known as a platform. Since Java has a runtime environment (JRE) and API, it is called a platform. Our core Java programming tutorial is designed for students and working professionals. Java is an object-oriented, class-based, concurrent, secured and general-purpose computer-programming language. It is a widely used robust technology.",
    "premiumStatus": false
  },
  {
    "id": "04",
    "name": "C/C++",
    "title": "C/C++ Tutorial",
    "price": "120",
    "thumbnail_url": "https://i.ibb.co/SVNL61m/C-thumbnail.png",
    "img_url": "https://i.ibb.co/DDrHZZq/c.png",
    "ques": "What is C/C++",
    "details": "C language is considered as the mother language of all the modern programming languages because most of the compilers, JVMs, Kernels, etc. are written in C language, and most of the programming languages follow C syntax, for example, C++, Java, C#, etc. C++ is a general purpose, case-sensitive, free-form programming language that supports object-oriented, procedural and generic programming. A system programming language is used to create system software. C language is a system programming language because it can be used to do low-level programming (for example driver and kernel). It is generally used to create hardware devices, OS, drivers, kernels, etc. For example, Linux kernel is written in C. C++ is a middle-level language, as it encapsulates both high and low level language features.",
    "premiumStatus": false
  },
  {
    "id": "05",
    "name": "PHP",
    "title": "PHP Tutorial",
    "price": "160",
    "thumbnail_url": "https://i.ibb.co/ySy0VBg/php-thumbnail.png",
    "img_url": "https://i.ibb.co/b12RySw/PHP.png",
    "ques": "What is PHP",
    "details": "PHP is an open-source, interpreted, and object-oriented scripting language that can be executed at the server-side. PHP is well suited for web development. Therefore, it is used to develop web applications (an application that executes on the server and generates the dynamic page.). PHP tutorial for beginners and professionals provides in-depth knowledge of PHP scripting language. Our PHP tutorial will help you to learn PHP scripting language easily. This PHP tutorial covers all the topics of PHP such as introduction, control statements, functions, array, string, file handling, form handling, regular expression, date and time, object-oriented programming in PHP, math, PHP MySQL, PHP with Ajax, PHP with jQuery and PHP with XML.",
    "premiumStatus": true
  },
  {
    "id": "06",
    "name": "SQL",
    "title": "SQL Tutorial",
    "price": "190",
    "thumbnail_url": "https://i.ibb.co/4m3nfmm/sql-thumbnail.jpg",
    "img_url": "https://i.ibb.co/Y2DPjhR/SQL.png",
    "ques": "What is SQL",
    "details": "SQL is a short-form of the structured query language, and it is pronounced as S-Q-L or sometimes as See-Quell. This database language is mainly designed for maintaining the data in relational database management systems. It is a special tool used by data professionals for handling structured data (data which is stored in the form of tables). It is also designed for stream processing in RDSMS. You can easily create and manipulate the database, access and modify the table rows and columns, etc. This query language became the standard of ANSI in the year of 1986 and ISO in the year of 1987. If you want to get a job in the field of data science, then it is the most important query language to learn. Big enterprises like Facebook, Instagram, and LinkedIn, use SQL for storing the data in the back-end.",
    "premiumStatus": true
  },
  {
    "id": "07",
    "name": "Ruby",
    "title": "Ruby Tutorial",
    "price": "250",
    "thumbnail_url": "https://i.ibb.co/Fs4N458/ruby-thumbnail.png",
    "img_url": "https://i.ibb.co/PZmp0wJ/ruby.png",
    "ques": "What is Ruby",
    "details": "Ruby tutorial provides basic and advanced concepts of Ruby. Our Ruby programming tutorial is designed for beginners and professionals both. Ruby is an open-source and fully object-oriented programming language. Ruby is a dynamic, open source, object oriented and reflective programming language. Ruby is considered similar to Perl and Smalltalk programming languages. It runs on all types of platforms like Windows, Mac OS and all versions of UNIX. It is fully object oriented programming language. Everything is an object in Ruby. Each and every code has their properties and actions. Here properties refer to variables and actions refer to methods. Ruby is considered to follow the principle of POLA (principle of least astonishment). It means that the language behaves in such a way to minimize the confusion for experienced users. Our Ruby tutorial includes all topics of Ruby such as installation, example, operators, control statements, loops, comments, arrays, strings, hashes, regular expressions, file handling, exception handling, OOPs, Ranges, Iterators. etc",
    "premiumStatus": true
  }
]
